# Getting started with python

After this you will be able to:
1-Write basic code in Python
2-Work with various types of data in Python
3-Convert the data from one type to another
4-Use expressions and variables to perform operations

In [2]:
# Check the Python Version

import sys
print(sys.version)

3.9.12 (main, Apr  5 2022, 01:53:17)
[Clang 12.0.0 ]

In [1]:
# writing first Python code 
print('Hello, Python!')     #Congratulations on running your first Python code!

Hello, Python!

To write comments in Python, use the number symbol # before writing your comment.
When you run your code, Python will ignore everything past the # on a given line.

# Errors

if you spell print as frint, Python will display an error message. Give it a try:

In [3]:
# Print string as error message

frint("Hello, Python!")

NameError: name 'frint' is not defined

You'll notice that if we make a different type of mistake, by forgetting to close the string, we'll obtain a different error (i.e., a SyntaxError). Try it below:

In [4]:
# Try to see built-in error message

print("Hello, Python!)

SyntaxError: EOL while scanning string literal (3628399183.py, line 3)

In [9]:
# To search any character from string

import re

In [10]:
s1 = "Michael Jackson is the best"

# Define the pattern to search for
pattern = r"Jackson"

# Use the search() function to search for the pattern in the string
result = re.search(pattern, s1)

# Check if a match was found
if result:
    print("Match found!")
else:
    print("Match not found.")

Match found!

# Strings attributes and functions

In [14]:
re.findall(r"M",s1)

['M']

In [7]:
"hello Mike".find("Mike")

6

In [2]:
L= ["nesting",2,3,4]
L.extend(["enclosing", "capstone"])
L

['nesting', 2, 3, 4, 'enclosing', 'capstone']

In [4]:
# Use append to add elements to list
# If we apply append instead of extend, we add one element to the list:
L = [ "Michael Jackson", 10.2]
L.append(['pop', 10])
L

['Michael Jackson', 10.2, ['pop', 10]]

In [6]:
# Use append to add elements to list

L.append(['a','b'])
L

['Michael Jackson', 10.2, ['pop', 10], ['a', 'b'], ['a', 'b']]

In [7]:
A = ["disco", 10, 1.2]
print('Before change:', A)
A[0] = 'hard rock'
print('After change:', A)

Before change: ['disco', 10, 1.2]
After change: ['hard rock', 10, 1.2]

In [8]:
# Delete the element based on the index

print('Before change:', A)
del(A[0])
print('After change:', A)

Before change: ['hard rock', 10, 1.2]
After change: [10, 1.2]

In [9]:
# Split the string, default is by space

'hard rock'.split()

['hard', 'rock']

In [10]:
# Split the string by comma

'A,B,C,D'.split(',')

['A', 'B', 'C', 'D']

# Lists

In [11]:
# Copy (copy by reference) the list A

A = ["hard rock", 10, 1.2]
B = A
print('A:', A)
print('B:', B)

A: ['hard rock', 10, 1.2]
B: ['hard rock', 10, 1.2]

In [12]:
# Examine the copy by reference

print('B[0]:', B[0])
A[0] = "banana"
print('B[0]:', B[0])

B[0]: hard rock
B[0]: banana

In [13]:
# Clone (clone by value) the list A

B = A[:]
B

['banana', 10, 1.2]

In [14]:
a_list=[1,'hello',[1,2,3], True]
a_list

[1, 'hello', [1, 2, 3], True]

In [15]:
a_list[1]

'hello'

In [16]:
a_list[1:4]

['hello', [1, 2, 3], True]

In [17]:
A = [1, 'a']
B = [2, 1, 'd']

In [21]:
A+B

[1, 'a', 2, 1, 'd']

In [22]:
A=[]

In [23]:
A

[]

In [24]:
shopping_list=['Watch','Laptop','Shoes','Pen','Clothes']

In [25]:
shopping_list.append('footbal')

In [26]:
shopping_list

['Watch', 'Laptop', 'Shoes', 'Pen', 'Clothes', 'footbal']

In [28]:
shopping_list[0]

'Watch'

In [29]:
shopping_list[5]

'footbal'

In [30]:
shopping_list[::]

['Watch', 'Laptop', 'Shoes', 'Pen', 'Clothes', 'footbal']

In [31]:
print(shopping_list[1:3])

['Laptop', 'Shoes']

In [40]:
shopping_list[3] = "notebook"
shopping_list

['Watch', 'Laptop', 'Shoes', 'notebook', 'Clothes', 'footbal']

In [41]:
del shopping_list[4]

In [43]:
shopping_list

['Watch', 'Laptop', 'Shoes', 'notebook', 'footbal']

# Tuple

In [44]:
# Create your first tuple

tuple1 = ("disco",10,1.2 )
tuple1

('disco', 10, 1.2)

In [45]:
# Print the type of value on each index

print(type(tuple1[0]))
print(type(tuple1[1]))
print(type(tuple1[2]))

<class 'str'>
<class 'int'>
<class 'float'>

In [46]:
tuple2 = tuple1 + ("hard rock", 10)
tuple2

('disco', 10, 1.2, 'hard rock', 10)

In [47]:
# Create a nest tuple

NestedT =(1, 2, ("pop", "rock") ,(3,4),("disco",(1,2)))

In [48]:
# Print element on each index

print("Element 0 of Tuple: ", NestedT[0])
print("Element 1 of Tuple: ", NestedT[1])
print("Element 2 of Tuple: ", NestedT[2])
print("Element 3 of Tuple: ", NestedT[3])
print("Element 4 of Tuple: ", NestedT[4])

Element 0 of Tuple:  1
Element 1 of Tuple:  2
Element 2 of Tuple:  ('pop', 'rock')
Element 3 of Tuple:  (3, 4)
Element 4 of Tuple:  ('disco', (1, 2))

In [51]:
# Print the first element in the second nested tuples

NestedT[2][1][::]

'rock'

In [52]:
# Print the second element in the second nested tuples

NestedT[2][1][1]

'o'

# Dictionary

In [53]:
# Create the dictionary

Dict = {"key1": 1, "key2": "2", "key3": [3, 3, 3], "key4": (4, 4, 4), ('key5'): 5, (0, 1): 6}
Dict

{'key1': 1,
 'key2': '2',
 'key3': [3, 3, 3],
 'key4': (4, 4, 4),
 'key5': 5,
 (0, 1): 6}

In [54]:
# Access to the value by the key

Dict["key1"]

1

In [55]:
# Access to the value by the key

Dict[(0, 1)]

6

In [56]:
# Create a sample dictionary

release_year_dict = {"Thriller": "1982", "Back in Black": "1980", \
                    "The Dark Side of the Moon": "1973", "The Bodyguard": "1992", \
                    "Bat Out of Hell": "1977", "Their Greatest Hits (1971-1975)": "1976", \
                    "Saturday Night Fever": "1977", "Rumours": "1977"}
release_year_dict

{'Thriller': '1982',
 'Back in Black': '1980',
 'The Dark Side of the Moon': '1973',
 'The Bodyguard': '1992',
 'Bat Out of Hell': '1977',
 'Their Greatest Hits (1971-1975)': '1976',
 'Saturday Night Fever': '1977',
 'Rumours': '1977'}

In [57]:
# Get value by keys

release_year_dict['Thriller']

'1982'

In [58]:
release_year_dict.keys()

dict_keys(['Thriller', 'Back in Black', 'The Dark Side of the Moon', 'The Bodyguard', 'Bat Out of Hell', 'Their Greatest Hits (1971-1975)', 'Saturday Night Fever', 'Rumours'])

In [59]:
release_year_dict.values()

dict_values(['1982', '1980', '1973', '1992', '1977', '1976', '1977', '1977'])

In [60]:
"Back in Black" in release_year_dict

True

In [61]:
# Append value with key into dictionary

release_year_dict['Graduation'] = '2007'
release_year_dict

{'Thriller': '1982',
 'Back in Black': '1980',
 'The Dark Side of the Moon': '1973',
 'The Bodyguard': '1992',
 'Bat Out of Hell': '1977',
 'Their Greatest Hits (1971-1975)': '1976',
 'Saturday Night Fever': '1977',
 'Rumours': '1977',
 'Graduation': '2007'}

In [62]:
del(release_year_dict["Graduation"])

In [63]:
release_year_dict

{'Thriller': '1982',
 'Back in Black': '1980',
 'The Dark Side of the Moon': '1973',
 'The Bodyguard': '1992',
 'Bat Out of Hell': '1977',
 'Their Greatest Hits (1971-1975)': '1976',
 'Saturday Night Fever': '1977',
 'Rumours': '1977'}

# Sets

In [65]:
# Sample set

A = ["Thriller", "Back in Black", "AC/DC"]

In [68]:
A=set(A)
A

{'AC/DC', 'Back in Black', 'Thriller'}

In [69]:
# Add element to set

A.add("NSYNC")
A

{'AC/DC', 'Back in Black', 'NSYNC', 'Thriller'}

In [70]:
# Remove the element from set

A.remove("NSYNC")
A

{'AC/DC', 'Back in Black', 'Thriller'}

In [71]:
'Back in Black' in A

True

In [72]:
# Sample Sets

album_set1 = set(["Thriller", 'AC/DC', 'Back in Black'])
album_set2 = set([ "AC/DC", "Back in Black", "The Dark Side of the Moon"])

In [76]:
# Print two sets

album_set1, album_set2

({'AC/DC', 'Back in Black', 'Thriller'},
 {'AC/DC', 'Back in Black', 'The Dark Side of the Moon'})

In [77]:
# Find the intersections

intersection = album_set1 & album_set2
intersection

{'AC/DC', 'Back in Black'}

In [78]:
album_set1.intersection(album_set2)

{'AC/DC', 'Back in Black'}

In [79]:
# Find the difference in set1 but not set2

album_set1.difference(album_set2)

{'Thriller'}

In [80]:
album_set2.difference(album_set1)

{'The Dark Side of the Moon'}

In [81]:
# Find the union of two sets

album_set1.union(album_set2)

{'AC/DC', 'Back in Black', 'The Dark Side of the Moon', 'Thriller'}

In [83]:
"ACDC" == "Michael Jackson"

"ACDC" != "Michael Jackson"

True

In [84]:
'B' > 'A'
'BA' > 'AB'

True

In [85]:
# If statement example

age = 19

#expression that can be true or false
if age > 18:
    
    #within an indent, we have the expression that is run if the condition is true
    print("you can enter" )

#The statements after the if statement will run regardless if the condition is true or false 
print("move on")

you can enter
move on

In [86]:
# Else statement example

age = 18
# age = 19

if age > 18:
    print("you can enter" )
else:
    print("go see Meat Loaf" )
    
print("move on")

go see Meat Loaf
move on

# Condition & IF statements

In [87]:
# Elif statment example

age = 18

if age > 18:
    print("you can enter" )
elif age == 18:
    print("go see Pink Floyd")
else:
    print("go see Meat Loaf" )
    
print("move on")

go see Pink Floyd
move on

In [88]:
# Condition statement example

album_year = 1983
album_year = 1970

if album_year > 1980:
    print("Album year is greater than 1980")
    
print('do something..')

do something..

In [1]:
album_year = 1970

if album_year > 1980:
    print("Album year is greater than 1980")
else:
    print("less than 1980")

print('do something..')

Album year is greater than 1980
do something..

In [90]:
# Condition statement example

album_year = 1980

if(album_year > 1979) and (album_year < 1990):
    print ("Album year was in between 1980 and 1989")
    
print("")
print("Do Stuff..")

Album year was in between 1980 and 1989

Do Stuff..

In [91]:
# Condition statement example

album_year = 1990

if(album_year < 1980) or (album_year > 1989):
    print ("Album was not made in the 1980's")
else:
    print("The Album was made in the 1980's ")

Album was not made in the 1980's

In [92]:
# Condition statement example

album_year = 1983

if not (album_year == 1984):
    print ("Album year is not 1984")

Album year is not 1984

#1. There are 2 sisters, Annie and Jane, born in 1996 and 1999 respectively. They want to know who was born in a leap year. Write an if-else statement to determine who was born in a leap year.

In [93]:
Annie=1996
Jane=1999
if Annie%4==0:
    print("Annie was born in a leap year")
elif Jane%4==0:
    print("Jane was born in a leap year")
else:
    print("None of them were born in a leap year")

Annie was born in a leap year

In [94]:
age = 10
if age <=9:
    print ("You will get a bowl of porridge!")
elif age>=10 and age<=14:
    print ("You will get a sandwich!")
elif age>=15 and age<=17:
    print("You will get a burger!")

You will get a sandwich!

# For Loop

In [99]:
for i in range(0,5):
    print(i)

0
1
2
3
4

In [100]:
# Use the range

range(3)

range(0, 3)

In [101]:
# For loop example

dates = [1982,1980,1973]
N = len(dates)

for i in range(N):
    print(dates[i])

1982
1980
1973

In [103]:
# Example of for loop

for i in range(0, 8):
    print(i)

0
1
2
3
4
5
6
7

In [104]:
# Exmaple of for loop, loop through list

for year in dates:  
    print(year)

1982
1980
1973

In [105]:
# Use for loop to change the elements in list

squares = ['red', 'yellow', 'green', 'purple', 'blue']

for i in range(0, 5):
    print("Before square ", i, 'is',  squares[i])
    squares[i] = 'white'
    print("After square ", i, 'is',  squares[i])

Before square  0 is red
After square  0 is white
Before square  1 is yellow
After square  1 is white
Before square  2 is green
After square  2 is white
Before square  3 is purple
After square  3 is white
Before square  4 is blue
After square  4 is white

In [106]:
# Loop through the list and iterate on both index and element value

squares=['red', 'yellow', 'green', 'purple', 'blue']

for i, square in enumerate(squares):
    print(i, square)

0 red
1 yellow
2 green
3 purple
4 blue

# While Loop

In [109]:
count = 1
while count <= 5:
    print(count)
    count += 1

1
2
3
4
5

In [110]:
# While Loop Example

dates = [1982, 1980, 1973, 2000]

i = 0
year = dates[0]

while(year != 1973):    
    print(year)
    i = i + 1
    year = dates[i]
    

print("It took ", i ,"repetitions to get out of loop.")

1982
1980
It took  2 repetitions to get out of loop.

In [117]:
mylist=['python','java', 'c++', 'R']
newlist=iter(mylist)
print(next(newlist)+ ' value')

python value

In [125]:
mylist=['python','java', 'c++', 'R']
for newlist in mylist:
    print(newlist)
    print(newlist+' Rate')

python
python Rate
java
java Rate
c++
c++ Rate
R
R Rate

In [126]:
list1=[2]
list2=[1,2,3,4,5,6,7,8,9,10]
for x in list1:
    for y in list2:
        print(f"{x}x{y}={x*y}")

2x1=2
2x2=4
2x3=6
2x4=8
2x5=10
2x6=12
2x7=14
2x8=16
2x9=18
2x10=20

In [131]:

list1=[2,3,4,5,6,7]
list2=[1,2,3,4,5,6,7,8,9,10]
for x in list1:
    for y in list2:
        print(f"{x}x{y}={x*y}")

2x1=2
2x2=4
2x3=6
2x4=8
2x5=10
2x6=12
2x7=14
2x8=16
2x9=18
2x10=20
3x1=3
3x2=6
3x3=9
3x4=12
3x5=15
3x6=18
3x7=21
3x8=24
3x9=27
3x10=30
4x1=4
4x2=8
4x3=12
4x4=16
4x5=20
4x6=24
4x7=28
4x8=32
4x9=36
4x10=40
5x1=5
5x2=10
5x3=15
5x4=20
5x5=25
5x6=30
5x7=35
5x8=40
5x9=45
5x10=50
6x1=6
6x2=12
6x3=18
6x4=24
6x5=30
6x6=36
6x7=42
6x8=48
6x9=54
6x10=60
7x1=7
7x2=14
7x3=21
7x4=28
7x5=35
7x6=42
7x7=49
7x8=56
7x9=63
7x10=70

In [146]:
for x in range(5):
    for y in range(5):
        print(f"{x}x{y}={x*y}")

0x0=0
0x1=0
0x2=0
0x3=0
0x4=0
1x0=0
1x1=1
1x2=2
1x3=3
1x4=4
2x0=0
2x1=2
2x2=4
2x3=6
2x4=8
3x0=0
3x1=3
3x2=6
3x3=9
3x4=12
4x0=0
4x1=4
4x2=8
4x3=12
4x4=16

In [147]:
print(list(range(10,0,-1)))

[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

In [148]:
x=5
y=1
while x>y:
    print(f"i run because,{x}>{y} returns {bool(x>y)}")
    
    y=y+1
else:
    print(f"i run because,{x}>{y} returns {bool(x>y)}")

i run because,5>1 returns True
i run because,5>2 returns True
i run because,5>3 returns True
i run because,5>4 returns True
i run because,5>5 returns False

In [150]:
def func_name(a):
    b=a+1
    return b

In [154]:
func_name(2)

3

In [155]:
def mult(a,b,c):
    d=a*b*c
    return d

In [156]:
mult(2,3,4)

24

In [163]:
def mult(a,b):
    d=a*b
    return d

In [164]:
mult(2,'saad')

'saadsaad'

In [165]:
# Function Definition

def square(a):
    
    # Local variable b
    b = 1
    c = a * a + b
    print(a, "if you square + 1", c) 
    return(c)

In [166]:
square(2)

2 if you square + 1 5

5

# Pandas

In [4]:
import pandas as pd
import numpy as np

In [5]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [6]:
x=df[['ID']]

In [7]:
x

   ID
0   1
1   2
2   3
3   4

# Pandas attributes & Functions

In [8]:
type(x)

pandas.core.frame.DataFrame

In [9]:
z=df[['Name','Department','Salary']]

In [10]:
z

   Name       Department  Salary
0  Rose  Architect Group  100000
1  John   Software Group   80000
2  Jane      Design Team   50000
3  Mary   Infrastructure   60000

In [11]:
a = {'Student':['David', 'Samuel', 'Terry', 'Evan'],
     'Age':['27', '24', '22', '32'],
     'Country':['UK', 'Canada', 'China', 'USA'],
     'Course':['Python','Data Structures','Machine Learning','Web Development'],
     'Marks':['85','72','89','76']}
df1 = pd.DataFrame(a)
df1

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [12]:
y=df1[['Country', 'Course', 'Age']]
y

  Country            Course Age
0      UK            Python  27
1  Canada   Data Structures  24
2   China  Machine Learning  22
3     USA   Web Development  32

In [13]:
x = df1['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [14]:
type(x)

pandas.core.series.Series

In [15]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'Rose'

In [16]:
# Access the value on the first row and the third column

df.iloc[0,2]

'Architect Group'

In [17]:
# Access the column using the name

df.loc[0, 'Salary']

100000

In [18]:
df2=df
df2=df2.set_index("Name")

In [19]:
#To display the first 5 rows of new dataframe
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [20]:
#Now, let us access the column using the name
df2.loc['Jane', 'Salary']

50000

In [21]:
df2.loc['Jane', 'Department']

'Design Team'

In [22]:
df2.iloc[3,2]

60000

In [23]:
df2.iloc[2,1]

'Design Team'

In [24]:
# let us do the slicing using old dataframe df

df2.iloc[0:2, 0:3]

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000

In [25]:
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [26]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [27]:
# Read data from CSV file

csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)

In [28]:
# Print first five rows of the dataframe

df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

In [29]:
# Read data from Excel File and print the first five rows

xlsx_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.xlsx'

df = pd.read_excel(xlsx_path)
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,00:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,00:46:33,"hard rock, progressive rock",20.6,43,1977-10-21,NaN,8.0

In [30]:
# Access to the column Length

x = df[['Length']]
x

     Length
0  00:42:19
1  00:42:11
2  00:42:49
3  00:57:44
4  00:46:33
5  00:43:08
6  01:15:54
7  00:40:01

In [31]:
# Get the column as a series

x = df['Length']
x

0    00:42:19
1    00:42:11
2    00:42:49
3    00:57:44
4    00:46:33
5    00:43:08
6    01:15:54
7    00:40:01
Name: Length, dtype: object

In [32]:
# Get the column as a dataframe

x = df[['Artist']]
type(x)

pandas.core.frame.DataFrame

In [33]:
# Access to multiple columns

y = df[['Artist','Length','Genre']]
y

            Artist    Length                        Genre
0  Michael Jackson  00:42:19               pop, rock, R&B
1            AC/DC  00:42:11                    hard rock
2       Pink Floyd  00:42:49             progressive rock
3  Whitney Houston  00:57:44               R&B, soul, pop
4        Meat Loaf  00:46:33  hard rock, progressive rock
5           Eagles  00:43:08   rock, soft rock, folk rock
6         Bee Gees  01:15:54                        disco
7    Fleetwood Mac  00:40:01                    soft rock

In [34]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'Michael Jackson'

In [35]:
# Access the value on the second row and the third column
df.iloc[1,2]

1980

In [36]:
# Access the column using the name

df.loc[0, 'Artist']

'Michael Jackson'

In [37]:
# Access the column using the name

df.loc[1, 'Released']

1980

In [38]:
# Slicing the dataframe

df.iloc[0:2, 0:3]

            Artist          Album  Released
0  Michael Jackson       Thriller      1982
1            AC/DC  Back in Black      1980

In [39]:
# Slicing the dataframe using name

df.loc[0:2, 'Artist':'Released']

            Artist                      Album  Released
0  Michael Jackson                   Thriller      1982
1            AC/DC              Back in Black      1980
2       Pink Floyd  The Dark Side of the Moon      1973

In [40]:
df.iloc[1,2]

1980

In [41]:
df_new=df

In [ ]:
df_new.index=new_index
df_new.loc['a', 'Artist']
df_new.loc['a':'d', 'Artist']
df_new

In [43]:
df_new

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,00:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,00:46:33,"hard rock, progressive rock",20.6,43,1977-10-21,NaN,8.0
5,Eagles,Their Greatest Hits (1971-1975),1976,00:43:08,"rock, soft rock, folk rock",32.2,42,1976-02-17,NaN,7.5
6,Bee Gees,Saturday Night Fever,1977,01:15:54,disco,20.6,40,1977-11-15,Y,7.0
7,Fleetwood Mac,Rumours,1977,00:40:01,soft rock,27.9,40,1977-02-04,NaN,6.5